# Задание_1
name_1 = 10;
name_2 = 20;
name_1 = int(name_1);
name_2 = int(name_2);
print(name_1 + name_2);


name_1 = int(input('Введите первый множитель - '));
name_2 = int(input('Введитете второй множитель - '));
product = int(name_1 * name_2);
print('Произведение равно - ', product);